"""Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый,
зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего
(зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке (красный,
желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод."""
from time import sleep

colors = {
    'red': 7,
    'yellow': 2,
    'green': 9
}


class TrafficLight:
    __color = None

    def running(self):
        for i in colors.keys():
            __color = i
            print(__color)
            sleep(colors[i])


traffic = TrafficLight()
traffic.running()
