"""Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список.
Класс-исключение должен контролировать типы данных элементов списка. Примечание: длина списка не фиксирована.
Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу скрипта, введя, например,
команду “stop”. При этом скрипт завершается, сформированный список выводится на экран. Подсказка: для данного задания
примем, что пользователь может вводить только числа и строки. При вводе пользователем очередного элемента необходимо
реализовать проверку типа элемента и вносить его в список, только если введено число. Класс-исключение должен не
позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение. При этом работа скрипта не
должна завершаться."""


class CheckListError(Exception):
    pass


my_list = []
while True:
    try:
        val = (input("Введите положительное число или f, чтобы закончить работу: "))
        if val != "f":
            if val.lstrip("-").isdigit():
                my_list.append(int(val))
            else:
                raise CheckListError
        else:
            print(f"Вот итоговый список: {my_list}")
            break
    except CheckListError:
        print(f"Это не число! Вот список на данный момент: {my_list}")
