"""Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123]."""

original_list = [1, 3, 5, 6, 6, 1, 7]
new_list = [el for num, el in enumerate(original_list) if original_list[num] > original_list[num-1]]

print(f"Изначальный список: {original_list}")
print(f"Новый список с условием: {new_list}")